{"basics":{"name":"Tongze Mao","label":"Mobile App Developer & Full-Stack Engineer (HCI & AI)","image":"tree_square.jpg","email":"tongzemao@gmail.com","url":"https://t-mao.github.io","summary":"Full-stack engineer specializing in robust, user-centric mobile applications, with proven expertise in Swift, React, Flutter, Python, and MySQL. Graduated CUM LAUDE from UC Irvine, earning dual degrees in Computer Science and Informatics plus a minor in Statistics, and achieved the Dean’s Honor List for 10 quarters. Adept at Agile methodologies, bridging UI/UX design with efficient back-end architectures, and leveraging AI insights to create intuitive, high-impact solutions. Seeking to drive innovation and solve real-world problems through intelligent systems and engaging user interfaces."},"work":[{"name":"Veeva Systems","position":"Associate Software Engineer in Test - Infrastructure","url":"https://t-mao.github.io/projects/Veeva/","startDate":"2025-09-15","summary":"Build and expand automated test coverage for Vault core infrastructure (Durable Queue Framework, FileManager/FSA, Configuration Framework), improving release confidence and platform reliability.","highlights":["Design white-box tests, reusable harnesses, and tooling to exercise critical paths and edge cases.","Improve CI/CD gates and code coverage; reduce flakiness via deterministic fixtures and idempotent teardown.","Validate behavior across deployment lifecycles, HA/DR scenarios, performance, and scalability.","Partner with platform/SRE on observability, alerting, and failure injection to raise reliability.","Author docs, runbooks, and examples to help engineers adopt frameworks safely and quickly."]},{"name":"SupTech","position":"Software Developer & Team Lead","url":"https://t-mao.github.io/projects/SupTech/","startDate":"2024-04-23","endDate":"2025-04-11","summary":"Led a four-engineer team that shipped SupTech’s first self-service Consumer & Technician apps (Flutter + Firebase). Introduced a Node.js micro-service layer, WebSocket gateway, and TDD culture, cutting customer-support workload by 85 %.","highlights":["Architected horizontally-scalable socket gateway (10 k concurrent) and drove real-time latency below 150 ms.","Built state-machine order workflow with FCM push; dispatch SLA improved 70 %, manual Excel trackers eliminated.","Integrated Stripe Connect (instant payout / escrow), geo-search (Haversine), multilingual UI, and AI repair assistant.","Implemented RSA-2048 handshake + AES-GCM channels → 100 % PCI-DSS & SOC 2 compliance, boosting customer trust.","Automated Fastlane + GitHub Actions releases; mean time-to-release = 2 days across 14 sprints (98 % on-time).","Raised Dart monorepo coverage to 96 % (≈500 tests) and scheduled nightly regressions via CI matrix."]},{"name":"TZAppify","position":"Founder & Principal Engineer","url":"https://t-mao.github.io/projects/TZAppify/","startDate":"2024-01-01","endDate":"2025-08-24","summary":"One-person indie studio creating data-driven productivity & lifestyle apps in SwiftUI. Shipped 8 native iOS titles; flagship DoneTodo hit #18 Productivity, with two follow-ups landing in the Lifestyle top-200 within 10 days.","highlights":["Solo-ideated, designed, coded, and released 8 SwiftUI apps; repeatable product–market fit validated by App Store charts.","Reusable Swift packages (iCloud sync, 50-level undo/redo, Swift Charts analytics) cut new-app effort ≈80 %.","Firebase Analytics + event funnels lifted D7 retention by 23 % through onboarding A/B tweaks.","1-click Fastlane pipeline (GitHub Actions → TestFlight → notarization) enables <48 h commit-to-release."]},{"name":"The Chinese University of Hong Kong","position":"Research Intern – Stereo 3D Reconstruction","url":"https://t-mao.github.io/projects/CUHK/","startDate":"2023-06-01","endDate":"2023-08-31","summary":"Optimized an 80 GB endoscopic stereo-video pipeline and explored NeRF/point-cloud methods for medical imaging research.","highlights":["Automated frame alignment, disparity maps, and COLMAP pose extraction—pipeline 65 % faster than prior flow.","Maintained concise wiki + weekly briefs; enabled five new researchers to reproduce results within 24 h."]},{"name":"HD EDU","position":"Senior Calculus Tutor","url":"https://t-mao.github.io/projects/HDTutor/","startDate":"2021-07-01","endDate":"2024-06-01","summary":"Taught 200 + students single- and multivariable calculus in remote settings; twice promoted for sustained 5-star feedback.","highlights":["Designed curricula on antiderivatives, FTC, Taylor series, and multivariable topics; >200 teaching hours.","Authored problem banks & grading scripts, demonstrating strong communication and mentoring skills."]},{"name":"HD EDU","position":"New-Media Content Creator & Social Media Strategist","url":"https://t-mao.github.io/projects/HDRedNote/","startDate":"2024-06-01","endDate":"2024-12-01","summary":"Ran HD EDU’s official RedNote channel, delivering bite-sized academic tips for international students and refining content strategy through analytics.","highlights":["Published trending, action-oriented posts mixing study hacks and lighter cultural pieces to keep engagement high.","Used in-app metrics to optimize topics, posting cadence, and targeting, steadily growing follower base.","Collaborated with stakeholders to protect brand voice while streamlining the draft–review–publish loop."]}],"education":[{"institution":"University of California, Irvine","location":"Irvine, CA","url":"https://t-mao.github.io/projects/UCI/","area":"B.S. in Computer Science & Informatics | Minor in Statistics","studyType":"Bachelor of Science (GPA: 3.94 / 4.0, CUM LAUDE)","startDate":"2020-09-01","endDate":"2024-06-01","courses":["Double Major & Specializations: Completed Computer Science and Informatics (Human-Computer Interaction, Intelligent Systems).","Core CS & Software Engineering: Mastered fundamentals (Boolean Logic, Data Structures, System Design) and progressed to advanced ML/AI projects (COMPSCI 178, 175) and user-centric design (IN4MATX 131, 133).","Full-Cycle Development: Oversaw requirements, coding, and testing in team projects; led subteams and maintained agile workflows.","Statistics Minor: Strengthened data analysis skills (STATS 110, 111, 120A–C), integrating hypothesis testing and regression modeling.","Leadership & Communication: Authored comprehensive documentation (I&C SCI 139W), conducted code reviews, and managed team sprints."],"summary":"Graduated CUM LAUDE with dual majors in Computer Science & Informatics plus a Minor in Statistics. Maintained a 3.94 GPA, earning placement on the Dean’s Honor List for 10 quarters, reflecting high academic standing and consistent excellence."},{"institution":"The Chinese University of Hong Kong","location":"Hong Kong","url":"https://t-mao.github.io/projects/CUHK/","area":"Dataset Engineering & Stereo 3D Reconstruction","studyType":"Research Internship (GPA: 4.0)","startDate":"2023-06-01","endDate":"2023-08-01","courses":["Data Pipeline & Preprocessing: Developed scripts to split stereo frames, generate depth via disparity estimation, and organize large-scale endoscopic datasets for real-time 3D analysis.","Pose & Registration: Explored classical SfM (COLMAP) and neural-based 3D alignment techniques, merging camera parameter outputs with NeRF-based coordinate systems for robust pose estimation.","Technical Literature & Collaboration: Conducted reviews on NeRF, point cloud registration, and non-rigid alignment algorithms, summarizing findings for the research team and ensuring swift onboarding for new members."],"summary":"Participated in a cutting-edge medical imaging project focusing on 3D reconstruction of endoscopic scenes, leveraging stereo video data and Neural Radiance Fields (NeRF)."},{"institution":"Arcadia High School","location":"Arcadia, CA","url":"https://t-mao.github.io/projects/AHS/","area":"High School Diploma","studyType":"High School (GPA: 3.97 / 4.0, Salutatorian)","startDate":"2018-02-01","endDate":"2020-06-01","courses":["Salutatorian Honor: Graduated as Class of 2020 Salutatorian, recognized for consistent academic excellence, leadership, and strong community engagement.","Rigorous STEM Focus: Completed AP Computer Science A, AP Physics C, and AP Calculus AB alongside Honors-level math courses, reinforcing strong computational and analytical skills.","Coding & Programming Club: Gained hands-on experience developing mini-games (e.g., classic “Snake” in Python) and tackling coding challenges, strengthening problem-solving abilities.","Community & Mentorship: Developed apps and small software projects to engage younger students in educational games (math drills, learning-based mini-games), reflecting a passion for using technology to inspire and teach others.","Design & Art Initiatives: Won the Speech & Debate Team Poster Contest from hundreds of submissions; Created the official poster for the Annual Art Exhibition and had a digital collage selected for display."],"summary":"Graduated as the Class of 2020 Salutatorian, recognized for exemplary academic performance, leadership, and community engagement."}],"certificates":[{"name":"Game Development Certificate","date":"2025-07-31","issuer":"ed2go | Education To Go","url":"https://t-mao.github.io/blog/2025/Game-Development-Bootcamp/","icon":"fa-solid fa-gamepad","summary":"Built a solid foundation in game design and development workflows for modern platforms (desktop, console, and mobile). Explored game genres, user interface design, production pipelines, development tools, and testing/release cycles. Gained practical insight into career paths, teamwork, and industry-standard practices for launching engaging digital games."},{"name":"Java Development Certificate","date":"2025-07-31","issuer":"ed2go | Education To Go","url":"","icon":"fa-brands fa-java","summary":"Developed robust programming skills in Java, covering core language syntax, data types, object-oriented programming, error handling, debugging, and GUI/graphics basics. Completed practical projects on algorithmic logic, input/output processing, and software design patterns, with emphasis on writing efficient, maintainable code ready for real-world applications."},{"name":"Career Skills Certificate: Computer Programming I","date":"2019-05-01","issuer":"Arcadia High School","url":"","icon":"fa-solid fa-laptop","summary":"Laid the groundwork for coding proficiency by introducing core programming environments, control structures, and ethical computing principles. Emphasized structured problem-solving, language fundamentals (e.g., variables, loops), and modern best practices in software development."},{"name":"Career Skills Certificate: Computer Programming II Java","date":"2019-05-01","issuer":"Arcadia High School","url":"","icon":"fa-solid fa-laptop","summary":"Expanded programming competence with advanced object-oriented design (OOP), searching/sorting algorithms, and the use of Unified Modeling Language (UML). Covered multidimensional arrays, dynamic data structures, and abstract data types—preparing students for complex, real-world coding challenges."},{"name":"Career Skills Certificate: Computer Programming IB Java","date":"2019-05-01","issuer":"Arcadia High School","url":"","icon":"fa-solid fa-laptop","summary":"Highest-level certification culminating in team-based projects and in-depth OOP mastery. Incorporated arrays, sequential file operations, and agile collaboration techniques while highlighting career pathways in Computer Programming and Software Engineering. Reflects a strong command of industry-relevant skills and readiness to tackle professional-level coding tasks."},{"name":"SQL Certificate","date":"2025-09-05","issuer":"ed2go | Education To Go","url":"","icon":"fa-solid fa-database","summary":"Instructor-led training in relational databases and SQL. Practiced in SSMS with graded exercises covering schema design and normalization (1NF–3NF), DDL/DML, SELECT with WHERE/GROUP BY/HAVING, INNER/LEFT JOINs, subqueries, basic views and indexes. Emphasis on query correctness, data integrity checks, edge cases, and baseline performance review."},{"name":"Certificate in Depression","date":"2025-06-17","issuer":"ALLEGRA Learning Solutions (ANCC-accredited)","url":"https://t-mao.github.io/blog/2025/Certificate-in-Depression/","icon":"fa-solid fa-heart-pulse","summary":"Completed clinical training on the symptoms, risk factors, assessment tools, and integrative treatment options for depression—knowledge now informing user-centric app features, team well-being practices, and mental-health-positive design decisions."},{"name":"Accounting Fundamentals – Bookkeeping & Financial Reporting","date":"2025-07-31","issuer":"ed2go | Education To Go","url":"","icon":"fa-solid fa-file-invoice-dollar","summary":"Double-entry bookkeeping, journalizing, general ledger, payroll, bank reconciliation, and comprehensive financial statement preparation. Developed practical skills in managing accounts payable/receivable, end-of-period adjustments, and generating reports critical for business analysis and compliance."},{"name":"QuickBooks Certificate – Accounting & Bookkeeping","date":"2025-07-31","issuer":"ed2go | Education To Go","url":"","icon":"fa-solid fa-calculator","summary":"Gained hands-on experience in QuickBooks Online for business accounting, including file setup, bank reconciliation, invoicing, expense management, and custom reporting."},{"name":"Teaching Pedagogy Certificate","date":"2021-08-04","issuer":"HD EDU","url":"","icon":"fa-solid fa-chalkboard-teacher","summary":"Completed a 7-day instructor training program covering pedagogy, lesson planning, assessment design, active learning, classroom management, and professional communication. Passed a micro-teaching practicum and final evaluation and subsequently joined the Calculus tutoring team."}],"publications":[],"skills":[{"name":"Mobile & Full-Stack Development","level":"Advanced","icon":"fa-solid fa-mobile-screen","keywords":["Swift (iOS, SwiftUI, Concurrency)","React / React Native","Flutter (Dart)","JavaScript (ES6+)","HTML / CSS / TypeScript","Shell Scripting (Bash, Zsh)","Agile / Scrum Practices"]},{"name":"Programming & AI","level":"Advanced","icon":"fa-solid fa-brain","keywords":["Python (NumPy, scikit-learn)","C++ / C (Systems & OOP)","Java (OOP & Data Structures)","MIPS (Assembly)","MATLAB (Data Analysis)","R (Statistical Computing)","Machine Learning Fundamentals","Algorithmic Complexity"]},{"name":"Databases & Cloud","level":"Intermediate","icon":"fa-solid fa-database","keywords":["Firebase (Firestore, Auth)","MySQL (Relational Schema Design)","MongoDB (NoSQL)","Node.js / Express (REST APIs)","Postman (API Testing)","API Integrations & Webhooks"]},{"name":"Design & Collaboration","level":"Advanced","icon":"fa-solid fa-pencil-ruler","keywords":["Figma (Wireframing, Prototyping)","Adobe Photoshop / Illustrator","MS Office Suite (Excel, Word, PowerPoint)","Jira (Agile Project Tracking)","GitHub (Version Control & Code Review)","UI/UX Research & Design Principles"]}],"projects":[{"name":"DoneTodo – Visual Time-Planning & Tracking App","summary":"A SwiftUI-based scheduling solution that lets users literally paint their day in color-coded tasks—contrasting planned vs. completed time. Built single-handedly, from UI/UX design to code architecture, local storage, advanced gestures, and App Store release.","highlights":["Engineered a 24×6 interactive grid with 10-minute blocks. Tapping or dragging applies two color layers (Plan vs. Done) to reflect scheduled vs. actual usage.","Implemented a robust undo/redo system storing entire day snapshots—giving users 50+ levels of reliable change rollback.","Developed calendar-based navigation with vertical swipes to jump seamlessly between dates, all while preserving custom color-coded data and local JSON persistence.","Designed and built an analytics suite with pie/bar charts to reveal time distribution and highlight discrepancies between planned and actual activities."],"startDate":"2024-08-01","endDate":"Present","url":"https://t-mao.github.io/projects/DoneTodo/"},{"name":"ThreeCalc – Triple-Calculator iOS App","summary":"An all-in-one SwiftUI calculator with three distinct calculators in one interface, each possessing its own scrollable history and interactive result reuse. Single-handedly created to handle finance, tipping, and day-to-day calculations without losing track of progress.","highlights":["Architected three calculators within a PageTabViewStyle to keep every calculation thread separate—no more mixed results or confusing histories.","Crafted a Decimal-based expression evaluator to minimize floating-point inaccuracies, crucial for precise financial/engineering tasks.","Integrated an interactive history feature: users tap past results to insert values into new expressions, or long-press to copy/delete them.","Executed the entire product pipeline independently: conceptual design, coding, debugging, SwiftUI layout, App Store deployment, and version updates."],"startDate":"2024-01-19","endDate":"Present","url":"https://t-mao.github.io/projects/3Calc/"},{"name":"FontMate – iOS Font Explorer & SwiftUI Snippet Generator","summary":"A SwiftUI-powered iOS app for quickly previewing every native system font. Automatically generates SwiftUI font code, including size, weight, and color parameters. Solely developed from concept to App Store release.","highlights":["Displays real-time previews for any system font, letting designers and developers compare typefaces at various sizes, weights, and colors.","One-tap SwiftUI snippet generation: user picks the font, weight, color, and the app produces code for easy copying into Xcode.","Enables saving favorite fonts for quick reference; all data persisted locally with JSON and @AppStorage for user-friendly retrieval.","Singlehandedly managed the end-to-end process: design, architecture, Swift/SwiftUI coding, testing, marketing, and iterative version updates."],"startDate":"2025-03-26","endDate":"Present","url":"https://t-mao.github.io/projects/FontMate/"},{"name":"SparkDays – Habit Tracking & Reward System","summary":"A gamified habit-tracker built in SwiftUI. Users earn coins for completing daily tasks and redeem them in an in-app store. Entirely designed, coded, and maintained by a single developer.","highlights":["Implemented a daily check-in system with dynamic coin rewards—harder tasks earn more coins, and streaks earn bonus coins.","Introduced a personal in-app store with tiered items and experiences. Users spend accumulated coins to motivate consistent progress.","Devised a robust SwiftUI architecture with local JSON persistence, ensuring tasks, store data, and user settings stay in sync.","Oversaw every production step: conceptualization, UI/UX design, data modeling, coding, release, and ongoing iteration."],"startDate":"2025-03-17","endDate":"Present","url":"https://t-mao.github.io/projects/SparkDays/"},{"name":"WayLater – Self-Developed iOS Time-Capsule App","summary":"A solo-built SwiftUI app that lets users write letters to their future selves. Each letter stays locked until a chosen date, complete with photo attachments, comments, and local JSON storage. I coded every feature from concept to deployment.","highlights":["Created a date-gated letter mechanic—letters remain sealed until their receive date, then automatically unlock for reading or commentary.","Engineered the SwiftUI architecture, employing local JSON for reliable data persistence, user privacy, and offline usability.","Developed a built-in prompt system to spark writing ideas, encouraging deeper self-reflection and consistent letter creation.","Single-handedly drove the project: ideation, UI design, coding, local testing, iteration, and final submission to the App Store."],"startDate":"2025-03-03","endDate":"Present","url":"https://t-mao.github.io/projects/WayLater/"},{"name":"Flipperly – Solo-Developed iOS Flashcard App","summary":"A feature-rich flashcard application built entirely in SwiftUI, blending spaced-repetition logic, local JSON data storage, a 3D flipping animation, and user-friendly undone/redo capabilities—all crafted by a single developer.","highlights":["Authored every line of code: from data models (Flashcard, Deck) to SwiftUI’s 3D flipping animations, delivering a polished user experience.","Implemented a dynamic spaced-repetition system where ‘remembered’ cards reappear less often, optimizing learning efficiency.","Devised a custom undo/redo stack that reverses or replays incorrect reviews with a single tap—preventing accidental resets.","Handled all phases independently: concept, design, coding, QA, user feedback, and App Store publication, showcasing full-stack iOS expertise."],"startDate":"2025-03-03","endDate":"Present","url":"https://t-mao.github.io/projects/Flipperly/"},{"name":"HowDidI App – Paid Résumé-Sharing Platform","summary":"An iOS app allowing professionals to upload résumés for monetization, enabling readers to purchase passes and access first-hand application materials.","highlights":["Served as PM & technical lead for a 3-person university team, utilizing Swift and Firebase for real-time content synchronization.","Instituted Agile sprints with continuous requirement refinement, progress demos, and stakeholder feedback loops.","Mentored junior developers on comprehensive app-building processes: front-end design, back-end integration, user testing, and release management."],"startDate":"2024-06-17","endDate":"2024-10-24","url":"https://t-mao.github.io/projects/HowDidI/"},{"name":"ThreeTodo App – Efficient Task Management","summary":"Developed a highly intuitive task manager focused on minimal navigation and reduced UI overload, delivered under a tight five-day deadline.","highlights":["Engineered draggable tasks, inline editing, and context-sensitive menus single-handedly.","Demonstrated user-centric design, receiving praise for clarity and practicality.","Showcased rapid development proficiency and Agile-style iteration, completing an MVP swiftly."],"startDate":"2024-04-01","endDate":"2024-04-01","url":"https://t-mao.github.io/projects/ThreeTodo/"},{"name":"WriterCards App – Daily Creativity & Self-Reflection","summary":"An iOS app fostering daily creative writing and introspection, developed using Swift.","highlights":["Implemented Jira & GitHub tracking to avoid scope creep, ensuring an on-time and feature-focused release.","Owned the full development lifecycle—UI prototyping, coding, QA, and deployment—as a solo developer.","Elevated user engagement by promoting structured journaling habits, fostering personal growth and creativity."],"startDate":"2024-02-01","endDate":"2024-04-01","url":"https://t-mao.github.io/projects/WriterCards/"},{"name":"Goshsha App – Future AR Interactive Shopping","summary":"Revamped an AR-based shopping prototype for Gen Z by prioritizing UI/UX enhancements and stable cross-platform performance.","highlights":["Utilized React Expo for a seamless iOS/Android experience, significantly increasing accessibility.","Conducted weekly stakeholder sessions to iterate designs based on direct feedback, improving satisfaction rates.","Refined database architecture and front-end responsiveness while strategically reducing AR complexity for broader user appeal."],"startDate":"2024-01-01","endDate":"2024-06-01","url":"https://t-mao.github.io/projects/Goshsha/"},{"name":"LifeTune App – Streamlined Health Monitoring","summary":"A health-tracking application distilling complex data into simple visuals, providing motivational nudges to reduce data overload.","highlights":["Led user research, wireframing, and prototype development to validate core features.","Showcased aggregated dietary, fitness, and sleep metrics in a centralized, user-centric dashboard.","Employed iterative design sprints, applying feedback loops to elevate functionality and user satisfaction."],"startDate":"2024-01-01","endDate":"2024-03-01","url":"https://t-mao.github.io/projects/LifeTune/"},{"name":"MyWellness App – iOS Health & Fitness Assistant","summary":"An iOS app tracking and analyzing user fitness data, delivering personalized lifestyle recommendations through intuitive visuals.","highlights":["Swift-based mobile development with integrated data visualizations for diet, exercise, and sleep patterns.","Implemented a recommendation engine for targeted health advice, boosting user adherence.","Designed comprehensive brand visuals to solidify product identity."],"startDate":"2023-04-01","endDate":"2023-06-01","url":""},{"name":"Canvas for Neurodivergent Students – Enhanced LMS Accessibility","summary":"Enhanced LMS (Canvas) accessibility with Dark Mode, Text-to-Speech, and streamlined flows tailored to neurodivergent learners.","highlights":["Facilitated in-depth user interviews to pinpoint accessibility pain points and drive design decisions.","Developed wireframes and prototypes for inclusive UI/UX features, showcasing improved usability and reduced cognitive strain.","Achieved higher user satisfaction across diverse student profiles in beta testing phases."],"startDate":"2023-04-01","endDate":"2023-06-01","url":""},{"name":"Spotify Browser - High-Performance Music Streaming Web App","summary":"A high-performance Angular-based application replicating core Spotify features, featuring Node.js/Express and MongoDB on the back end.","highlights":["Incorporated OAuth authentication and real-time data retrieval from Spotify's API.","Leveraged lazy loading and caching strategies to reduce load times and optimize user experience.","Engineered multi-user session handling to accommodate concurrent logins with stable performance."],"startDate":"2022-10-01","endDate":"2022-11-01","url":"https://t-mao.github.io/projects/Spotify/"},{"name":"CheckersAI – Intelligent Board-Game Strategy","summary":"Developed an AI-driven Checkers agent to demonstrate high-level strategic decision-making in board games.","highlights":["Algorithmic Depth: Implemented alpha-beta pruning and heuristic-based evaluation to efficiently explore move trees and prioritize high-value captures.","Dynamic Board Adaptation: Built a robust board-state architecture to handle king promotions, multi-jumps, and real-time state shifts.","Performance Tuning: Iteratively refined scoring parameters (e.g., rewarding aggressive play, penalizing risky moves), significantly improving win rates against baseline AIs.","Scalable Codebase: Leveraged modular design to support various board sizes and game expansions, illustrating strong architecture and maintainability."],"startDate":"2022-09-01","endDate":"2022-12-01","url":"https://t-mao.github.io/projects/CheckersAI/"},{"name":"Cancer Observer – Preventive Healthcare Tracking","summary":"A WordPress-prototyped solution recommending timely cancer screenings based on personal health data and lifestyle factors.","highlights":["Established brand identity and web design to encourage consistent screening habits.","Programmed reminder notifications, furthering user engagement and medical adherence.","Displayed UI/UX proficiency in shaping preventive healthcare experiences."],"startDate":"2022-08-01","endDate":"2022-09-01","url":""},{"name":"App Inventor Challenge (2017) – My First Android Prototype","summary":"Built my first Android app with MIT App Inventor and participated in the 2017 National App Inventor Student Challenge. This experience kickstarted my path to mobile development.","highlights":["Explored event-driven programming with blocks; implemented multi-screen navigation and basic data storage.","Learned to scope features, test on-device APKs, and present a working demo under a deadline.","Reflected on UX trade-offs that later influenced my SwiftUI projects.","Mini apps I built at the time:","1. Competition Helper – quick calculators, multiple-choice quizzes, and a simple leaderboard (timers, score persistence).","2. Anti-Theft Alarm – arms the phone; any movement triggers vibration + siren (accelerometer events, state toggles).","3. Spider vs. Bugs – tap/drag to move a spider and eat randomly spawned bugs (sprite collisions, randomization)."],"startDate":"2017-06-01","endDate":"2017-10-10","url":""}],"awards":[{"title":"UCI CUM LAUDE","date":"2024-06-01","awarder":"University of California, Irvine","url":"https://t-mao.github.io/projects/UCI/","summary":"Granted upon graduation for exceptional academic performance across dual bachelor’s degrees (Computer Science & Informatics) and a minor in Statistics. Maintained a 3.94 GPA, demonstrating consistent dedication to rigorous coursework and research involvement."},{"title":"UCI Dean’s Honor List (10 quarters)","date":"2024-06-01","awarder":"University of California, Irvine","url":"https://t-mao.github.io/projects/UCI/","summary":"Recognized for outstanding academic standing over 10 quarters in dual B.S. programs, reflecting steadfast commitment and excellence across a broad spectrum of technical and interdisciplinary courses."},{"title":"HD EDU Senior Tutor Recognition","date":"2023-07-01","awarder":"HD EDU","url":"https://t-mao.github.io/projects/HDTutor/","summary":"Achieved multiple promotions in two years—initially to Advanced Tutor in 2022, followed by Senior Tutor in 2023—after teaching over 160 undergraduate students (200+ hours of instruction) in both single- and multivariable calculus. Reflects consistent high performance, exceptional curriculum design, and a proven track record of improving student outcomes."},{"title":"AHS Salutatorian","date":"2020-06-01","awarder":"Arcadia High School","url":"https://t-mao.github.io/projects/AHS/","summary":"Earned Class of 2020 Salutatorian distinction with a 3.97 GPA. Demonstrated leadership in academics, maintained exemplary attendance, and upheld a strong disciplinary record throughout high school."}],"volunteer":[{"organization":"Infinite Horizons Learning Collective","location":"Remote","position":"Founder & Organizer","url":"","startDate":"2023-11-01","endDate":"Present","summary":"Established a self-directed study group encouraging daily learning, knowledge sharing, and consistent personal growth beyond formal academics. Members dedicate a minimum of 40 minutes each day to explore new subjects and share insights.","highlights":["Created an accountability framework that led participants to collectively read over 200 books and deepen interdisciplinary understanding.","Developed and maintained a centralized progress-tracking platform, celebrating milestones and reinforcing long-term learning habits.","Fostered a diverse and supportive environment, promoting peer mentorship and collaborative problem-solving."]},{"organization":"Arcadia Performing Arts Foundation","location":"Arcadia, CA","position":"Volunteer (Theater & Event Support)","url":"https://www.arcadiapaf.org/","startDate":"2018-06-01","endDate":"2020-03-01","summary":"Contributed 46 hours in various capacities—such as ticket inspector, attendant, and cleaning staff—to ensure seamless theater productions and enhance attendee satisfaction.","highlights":["Facilitated front-of-house operations and audience management, aiding the success of multiple school district events.","Strengthened communication skills by engaging with diverse patrons and providing quality customer service.","Ensured a well-organized venue, reflecting a commitment to enriching the community’s cultural and educational experiences."]},{"organization":"TreePeople","location":"Los Angeles, CA","position":"Environmental Volunteer","url":"https://www.treepeople.org/","startDate":"2018-12-01","endDate":"2018-12-01","summary":"Participated in a urban reforestation initiative, planting trees and cleaning communal areas to foster environmental stewardship.","highlights":["Gained hands-on experience in sustainable tree planting methods and water conservation practices.","Collaborated with local residents to maximize community impact and promote a cleaner, healthier environment."]}],"languages":[{"language":"English","fluency":"Fluent","icon":""},{"language":"Mandarin","fluency":"Native speaker","icon":""}],"interests":[{"name":"Digital Illustration & Sticker Design","icon":"fa-solid fa-paintbrush","keywords":["Crocodile & fuzzy monster WeChat sticker sets (50k+ sends)","Adobe Photoshop & Illustrator artistry","Continuously experimenting with new mediums, color palettes, and digital art tools"],"summary":"Continually refine digital art skills by producing stickers that reach wide audiences and experimenting with unconventional mediums. Passionate about creating visually striking designs that spark conversations and bring joy to everyday messaging."},{"name":"Fine Arts & Exhibition","icon":"fa-solid fa-image","keywords":["Future Art China International Competition (Top 100 of 10,000)","Arcadia High School Annual Art Exhibition poster design","Visual storytelling & conceptual painting"],"summary":"Demonstrated a flair for creative expression by placing in the top 100 of an international art contest and designing posters exhibited to thousands. Skilled in blending research, environmental themes, and personal imagination to deliver compelling visual narratives."},{"name":"Writing & Literature","icon":"fa-solid fa-book","keywords":["Daily practice in Chinese writing","4th place in classical Chinese writing contest","Working towards publishing my novels that blends tradition with contemporary storytelling"],"summary":"Devoted to crafting engaging narratives through consistent writing, both in classical Chinese and modern forms. Passionate about weaving cultural depth into stories, with the ultimate goal of publishing a full-length novel that resonates with diverse audiences."},{"name":"Performing Arts & Dance","icon":"fa-solid fa-music","keywords":["Latin dancing & musicals","Orchesis Dance Company poster design","Enthusiastic about expressive movement and stagecraft"],"summary":"Immersed in the vibrant world of stage performance, from enjoying live musicals to creating eye-catching promotional materials. Draws inspiration from the energy of dance and music, fueling broader artistic and creative pursuits."}],"references":[]}