{"basics":{"name":"Tongze Mao","label":"Mobile App Developer & Full-Stack Engineer (HCI & AI)","image":"tree_square.jpg","email":"tongzemao@gmail.com","url":"https://t-mao.github.io","summary":"Full-stack engineer specializing in robust, user-centric mobile applications, with proven expertise in Swift, React, Flutter, Python, and MySQL. Graduated CUM LAUDE from UC Irvine, earning dual degrees in Computer Science and Informatics plus a minor in Statistics, and achieved the Dean’s Honor List for 9 quarters. Adept at Agile methodologies, bridging UI/UX design with efficient back-end architectures, and leveraging AI insights to create intuitive, high-impact solutions. Seeking to drive innovation and solve real-world problems through intelligent systems and engaging user interfaces."},"work":[{"name":"SupTech","position":"Software Developer & Team Lead","url":"https://t-mao.github.io/projects/SupTech/","startDate":"2024-04-01","endDate":"Present","summary":"Led end-to-end development of two cross-platform mobile apps (Consumer App & Technician App) from scratch using Flutter, Firebase, and MySQL—covering architecture design, coding, testing, and deployment for both iOS and Android. Leveraged robust Node.js + Express backend integration, advanced encryption (RSA + AES), and Stripe Connect for secure payments and delayed transfer scheduling. Oversaw the entire SDLC through Agile sprints, code reviews, and close stakeholder collaboration.","highlights":["Engineered multi-tier features, including real-time location tracking (Haversine), geospatial queries, FCM-based push notifications, and consumer–technician chat sessions.","Developed AI Repair module integrated with ChatGPT-like LLM to assist in self-diagnosis and on-demand technician requests.","Managed release cycles across App Store & Google Play, implementing CI/CD pipelines, semantic versioning, and user onboarding flows.","Implemented advanced UI/UX with multi-language support (English, Simplified/Traditional Chinese) and responsive layouts.","Mentored junior developers on Flutter best practices, facilitated daily stand-ups, backlog grooming, and sprint retros to boost dev throughput by ~50%."]},{"name":"HD EDU","position":"Senior Tutor (Single/Multi-variable Calculus)","url":"https://www.hdedu.ai/","startDate":"2021-07-01","endDate":"Present","summary":"Instruct over 160 undergraduate students in single-variable and multivariable calculus, accumulating more than 200 hours of teaching experience. Promoted to Senior Tutor in 2023 for consistently high feedback and the successful design of comprehensive course materials.","highlights":["Developed and delivered curricula covering Antiderivatives, the Fundamental Theorem of Calculus, Taylor series, and advanced multivariable topics.","Implemented structured lesson plans, interactive problem-solving sessions, and real-time Q&A channels to enhance student engagement.","Achieved measurable performance improvements across diverse learner populations through personalized teaching and targeted feedback loops.","Recognized as Senior Tutor after demonstrating exceptional teaching quality, proven course design, and consistently positive evaluations."]},{"name":"HD EDU","position":"New Media Content Creator & Social Media Strategist","url":"https://www.xiaohongshu.com/user/profile/609363c20000000001002f1b","startDate":"2024-06-01","endDate":"2024-12-01","summary":"Oversaw the official 小红书 (rednote) account for HD EDU, tailoring content for international students seeking academic tips and cultural insights. Balanced concise, visually engaging posts with data-driven refinements, demonstrating a fusion of technical expertise and creative marketing.","highlights":["Researched trending topics in overseas education and integrated personal experience into short-form posts, maximizing clarity and audience relatability.","Maintained a consistent posting schedule featuring “practical how-to” content—i.e., fully actionable advice and proven strategies—alongside lighter entertainment pieces to foster sustained follower engagement and platform growth.","Implemented metrics-based strategies—utilizing in-app analytics for post-performance tracking—to refine content themes, posting times, and audience targeting.","Leveraged Agile-like workflows: planned, drafted, reviewed, and published original articles efficiently, while responding to comments with courtesy and professional insight.","Collaborated with team stakeholders to align content quality, brand voice, and visual design, streamlining the feedback loop and upholding HD EDU’s brand identity."]}],"education":[{"institution":"University of California, Irvine","location":"Irvine, CA","url":"https://uci.edu","area":"Computer Science & Informatics (Minor in Statistics)","studyType":"Bachelor of Science (CUM LAUDE)","startDate":"2020-09-01","endDate":"2024-06-01","score":"GPA: 3.934 / 4.0","courses":["Algorithm","Artificial Intelligence","Data Mining","Machine Learning","Human-Computer Interaction","System Design","Software Engineering"],"summary":"Graduated CUM LAUDE with dual majors in Computer Science & Informatics plus a Minor in Statistics. Maintained a 3.934 GPA, earning placement on the Dean’s Honor List for 9 consecutive quarters, reflecting high academic standing and consistent excellence."},{"institution":"The Chinese University of Hong Kong","location":"Hong Kong","url":"https://www.cuhk.edu.hk/","area":"Summer Undergraduate Research Program","studyType":"Research Internship (GPA: 4.0)","startDate":"2023-06-01","endDate":"2023-08-01","courses":["EndoNeRF - Pose-Free Depth-Supervised Neural Radiance Fields"],"summary":"Contributed to advanced NeRF-based research focused on 3D scene reconstruction in endoscopic procedures, collaborating within a multidisciplinary team to address real-world medical imaging challenges."},{"institution":"Arcadia High School","location":"Arcadia, CA","url":"https://ahs.ausd.net/","area":"High School Diploma","studyType":"High School (Salutatorian)","startDate":"2018-02-01","endDate":"2020-06-01","score":"GPA: 3.97 / 4.0","summary":"Graduated as the Class of 2020 Salutatorian, recognized for exemplary academic performance, leadership, and community engagement."}],"certificates":[{"name":"Career Skills Certificate: Computer Programming I","date":"2019-05-01","issuer":"Arcadia High School","url":"","icon":"fa-solid fa-laptop","summary":"Laid the groundwork for coding proficiency by introducing core programming environments, control structures, and ethical computing principles. Emphasized structured problem-solving, language fundamentals (e.g., variables, loops), and modern best practices in software development."},{"name":"Career Skills Certificate: Computer Programming II Java","date":"2019-05-01","issuer":"Arcadia High School","url":"","icon":"fa-solid fa-laptop","summary":"Expanded programming competence with advanced object-oriented design (OOP), searching/sorting algorithms, and the use of Unified Modeling Language (UML). Covered multidimensional arrays, dynamic data structures, and abstract data types—preparing students for complex, real-world coding challenges."},{"name":"Career Skills Certificate: Computer Programming IB Java","date":"2019-05-01","issuer":"Arcadia High School","url":"","icon":"fa-solid fa-laptop","summary":"Highest-level certification culminating in team-based projects and in-depth OOP mastery. Incorporated arrays, sequential file operations, and agile collaboration techniques while highlighting career pathways in Computer Programming and Software Engineering. Reflects a strong command of industry-relevant skills and readiness to tackle professional-level coding tasks."}],"publications":[],"skills":[{"name":"Mobile & Full-Stack Development","level":"Advanced","icon":"fa-solid fa-mobile-screen","keywords":["Swift (iOS, SwiftUI, Concurrency)","React / React Native","Flutter (Dart)","JavaScript (ES6+)","HTML / CSS / TypeScript","Shell Scripting (Bash, Zsh)","Agile / Scrum Practices"]},{"name":"Programming & AI","level":"Advanced","icon":"fa-solid fa-brain","keywords":["Python (NumPy, scikit-learn)","C++ / C (Systems & OOP)","Java (OOP & Data Structures)","MIPS (Assembly)","MATLAB (Data Analysis)","R (Statistical Computing)","Machine Learning Fundamentals","Algorithmic Complexity"]},{"name":"Databases & Cloud","level":"Intermediate","icon":"fa-solid fa-database","keywords":["Firebase (Firestore, Auth)","MySQL (Relational Schema Design)","MongoDB (NoSQL)","Node.js / Express (REST APIs)","Postman (API Testing)","API Integrations & Webhooks"]},{"name":"Design & Collaboration","level":"Advanced","icon":"fa-solid fa-pencil-ruler","keywords":["Figma (Wireframing, Prototyping)","Adobe Photoshop / Illustrator","MS Office Suite (Excel, Word, PowerPoint)","Jira (Agile Project Tracking)","GitHub (Version Control & Code Review)","UI/UX Research & Design Principles"]}],"projects":[{"name":"DoneTodo App - Minimalistic Time-Planning Solution","summary":"A minimalistic time-planning app enabling effortless drag-and-drop scheduling, color-coded timelines, and detailed usage analytics.","highlights":["Developed a Swift-based iOS application emphasizing lightweight UI/UX, reducing user friction and cognitive load.","Integrated statistical modules to visualize real-time time-distribution trends, providing actionable insights.","Adhered to a 'less-is-more' philosophy, focusing on core productivity features to minimize bloat and streamline workflows."],"startDate":"2024-08-01","endDate":"Present","url":""},{"name":"HowDidI App – Paid Résumé-Sharing Platform","summary":"An iOS app allowing professionals to upload résumés for monetization, enabling readers to purchase passes and access first-hand application materials.","highlights":["Served as PM & technical lead for a 3-person university team, utilizing Swift and Firebase for real-time content synchronization.","Instituted Agile sprints with continuous requirement refinement, progress demos, and stakeholder feedback loops.","Mentored junior developers on comprehensive app-building processes: front-end design, back-end integration, user testing, and release management."],"startDate":"2024-06-17","endDate":"2024-10-24","url":""},{"name":"ThreeTodo App – Efficient Task Management","summary":"Developed a highly intuitive task manager focused on minimal navigation and reduced UI overload, delivered under a tight five-day deadline.","highlights":["Engineered draggable tasks, inline editing, and context-sensitive menus single-handedly.","Demonstrated user-centric design, receiving praise for clarity and practicality.","Showcased rapid development proficiency and Agile-style iteration, completing an MVP swiftly."],"startDate":"2024-04-01","endDate":"2024-04-01","url":""},{"name":"WriterCards App – Daily Creativity & Self-Reflection","summary":"An iOS app fostering daily creative writing and introspection, developed using Swift.","highlights":["Implemented Jira & GitHub tracking to avoid scope creep, ensuring an on-time and feature-focused release.","Owned the full development lifecycle—UI prototyping, coding, QA, and deployment—as a solo developer.","Elevated user engagement by promoting structured journaling habits, fostering personal growth and creativity."],"startDate":"2024-02-01","endDate":"2024-04-01","url":""},{"name":"Goshsha App – Future AR Interactive Shopping","summary":"Revamped an AR-based shopping prototype for Gen Z by prioritizing UI/UX enhancements and stable cross-platform performance.","highlights":["Utilized React Expo for a seamless iOS/Android experience, significantly increasing accessibility.","Conducted weekly stakeholder sessions to iterate designs based on direct feedback, improving satisfaction rates.","Refined database architecture and front-end responsiveness while strategically reducing AR complexity for broader user appeal."],"startDate":"2024-01-01","endDate":"2024-06-01","url":""},{"name":"LifeTune App – Streamlined Health Monitoring","summary":"A health-tracking application distilling complex data into simple visuals, providing motivational nudges to reduce data overload.","highlights":["Led user research, wireframing, and prototype development to validate core features.","Showcased aggregated dietary, fitness, and sleep metrics in a centralized, user-centric dashboard.","Employed iterative design sprints, applying feedback loops to elevate functionality and user satisfaction."],"startDate":"2024-01-01","endDate":"2024-03-01","url":""},{"name":"MyWellness App – iOS Health & Fitness Assistant","summary":"An iOS app tracking and analyzing user fitness data, delivering personalized lifestyle recommendations through intuitive visuals.","highlights":["Swift-based mobile development with integrated data visualizations for diet, exercise, and sleep patterns.","Implemented a recommendation engine for targeted health advice, boosting user adherence.","Designed comprehensive brand visuals to solidify product identity."],"startDate":"2023-04-01","endDate":"2023-06-01","url":""},{"name":"Canvas for Neurodivergent Students – Enhanced LMS Accessibility","summary":"Enhanced LMS (Canvas) accessibility with Dark Mode, Text-to-Speech, and streamlined flows tailored to neurodivergent learners.","highlights":["Facilitated in-depth user interviews to pinpoint accessibility pain points and drive design decisions.","Developed wireframes and prototypes for inclusive UI/UX features, showcasing improved usability and reduced cognitive strain.","Achieved higher user satisfaction across diverse student profiles in beta testing phases."],"startDate":"2023-04-01","endDate":"2023-06-01","url":""},{"name":"Spotify Browser - High-Performance Music Streaming Web App","summary":"A high-performance Angular-based application replicating core Spotify features, featuring Node.js/Express and MongoDB on the back end.","highlights":["Incorporated OAuth authentication and real-time data retrieval from Spotify's API.","Leveraged lazy loading and caching strategies to reduce load times and optimize user experience.","Engineered multi-user session handling to accommodate concurrent logins with stable performance."],"startDate":"2022-10-01","endDate":"2022-11-01","url":""},{"name":"CheckersAI – Intelligent Board-Game Strategy","summary":"An AI-driven Checkers agent built to showcase strategic decision-making in board games.","highlights":["Integrated heuristic-based search algorithms and alpha-beta pruning, enabling efficient move selection.","Adapted dynamically to various board states, demonstrating real-time strategy modifications."],"startDate":"2022-09-01","endDate":"2022-12-01","url":""},{"name":"Cancer Observer – Preventive Healthcare Tracking","summary":"A WordPress-prototyped solution recommending timely cancer screenings based on personal health data and lifestyle factors.","highlights":["Established brand identity and web design to encourage consistent screening habits.","Programmed reminder notifications, furthering user engagement and medical adherence.","Displayed UI/UX proficiency in shaping preventive healthcare experiences."],"startDate":"2022-08-01","endDate":"2022-09-01","url":""}],"awards":[{"title":"UCI CUM LAUDE","date":"2024-06-01","awarder":"University of California, Irvine","url":"","summary":"Granted upon graduation for exceptional academic performance across dual bachelor’s degrees (Computer Science & Informatics) and a minor in Statistics. Maintained a 3.934 GPA, demonstrating consistent dedication to rigorous coursework and research involvement."},{"title":"Dean’s Honor List (9 Quarters)","date":"2024-06-01","awarder":"University of California, Irvine","url":"","summary":"Recognized for outstanding academic standing over nine quarters in dual B.S. programs, reflecting steadfast commitment and excellence across a broad spectrum of technical and interdisciplinary courses."},{"title":"HD EDU Senior Tutor Recognition","date":"2023-07-01","awarder":"HD EDU","url":"","summary":"Achieved multiple promotions in two years—initially to Advanced Tutor in 2022, followed by Senior Tutor in 2023—after teaching over 160 undergraduate students (200+ hours of instruction) in both single- and multivariable calculus. Reflects consistent high performance, exceptional curriculum design, and a proven track record of improving student outcomes."},{"title":"Arcadia High School Salutatorian","date":"2020-06-01","awarder":"Arcadia High School","url":"","summary":"Earned Class of 2020 Salutatorian distinction with a 3.97 GPA. Demonstrated leadership in academics, maintained exemplary attendance, and upheld a strong disciplinary record throughout high school."}],"volunteer":[{"organization":"Infinite Horizons Learning Collective","location":"Remote","position":"Founder & Organizer","url":"","startDate":"2023-11-01","endDate":"Present","summary":"Established a self-directed study group encouraging daily learning, knowledge sharing, and consistent personal growth beyond formal academics. Members dedicate a minimum of 40 minutes each day to explore new subjects and share insights.","highlights":["Created an accountability framework that led participants to collectively read over 200 books and deepen interdisciplinary understanding.","Developed and maintained a centralized progress-tracking platform, celebrating milestones and reinforcing long-term learning habits.","Fostered a diverse and supportive environment, promoting peer mentorship and collaborative problem-solving."]},{"organization":"Arcadia Performing Arts Foundation","location":"Arcadia, CA","position":"Volunteer (Theater & Event Support)","url":"","startDate":"2018-06-01","endDate":"2020-03-01","summary":"Contributed 46 hours in various capacities—such as ticket inspector, attendant, and cleaning staff—to ensure seamless theater productions and enhance attendee satisfaction.","highlights":["Facilitated front-of-house operations and audience management, aiding the success of multiple school district events.","Strengthened communication skills by engaging with diverse patrons and providing quality customer service.","Ensured a well-organized venue, reflecting a commitment to enriching the community’s cultural and educational experiences."]},{"organization":"TreePeople","location":"Los Angeles, CA","position":"Environmental Volunteer","url":"https://www.treepeople.org/","startDate":"2018-12-01","endDate":"2018-12-01","summary":"Participated in a urban reforestation initiative, planting trees and cleaning communal areas to foster environmental stewardship.","highlights":["Gained hands-on experience in sustainable tree planting methods and water conservation practices.","Collaborated with local residents to maximize community impact and promote a cleaner, healthier environment."]}],"languages":[{"language":"English","fluency":"Fluent","icon":""},{"language":"Mandarin","fluency":"Native speaker","icon":""}],"interests":[{"name":"Digital Illustration & Sticker Design","icon":"fa-solid fa-paintbrush","keywords":["Crocodile & fuzzy monster WeChat sticker sets (50k+ sends)","Adobe Photoshop & Illustrator artistry","Continuously experimenting with new mediums, color palettes, and digital art tools"],"summary":"Continually refine digital art skills by producing stickers that reach wide audiences and experimenting with unconventional mediums. Passionate about creating visually striking designs that spark conversations and bring joy to everyday messaging."},{"name":"Fine Arts & Exhibition","icon":"fa-solid fa-image","keywords":["Future Art China International Competition (Top 100 of 10,000)","Arcadia High School Annual Art Exhibition poster design","Visual storytelling & conceptual painting"],"summary":"Demonstrated a flair for creative expression by placing in the top 100 of an international art contest and designing posters exhibited to thousands. Skilled in blending research, environmental themes, and personal imagination to deliver compelling visual narratives."},{"name":"Writing & Literature","icon":"fa-solid fa-book","keywords":["Daily practice in Chinese writing","4th place in classical Chinese writing contest","Working towards publishing my novels that blends tradition with contemporary storytelling"],"summary":"Devoted to crafting engaging narratives through consistent writing, both in classical Chinese and modern forms. Passionate about weaving cultural depth into stories, with the ultimate goal of publishing a full-length novel that resonates with diverse audiences."},{"name":"Performing Arts & Dance","icon":"fa-solid fa-music","keywords":["Latin dancing & musicals","Orchesis Dance Company poster design","Enthusiastic about expressive movement and stagecraft"],"summary":"Immersed in the vibrant world of stage performance, from enjoying live musicals to creating eye-catching promotional materials. Draws inspiration from the energy of dance and music, fueling broader artistic and creative pursuits."}],"references":[]}